[
    {
        "id": "intro",
        "icon": "fas fa-mobile",      
        "title": "Introdução",
        "date": "04/05/2022",
        "content": "Aplicação focada na coleta de leite dos carreteiros, passando pelas linhas de coleta, pegando informações dos tanques e do leite coletado atualmente.",
        "lightbox": []
    },
    {
        "id": "1",
        "icon": "fas fa-cog",     
        "title": "Configurações Iniciais",
        "date": "2022-05-04",
        "content": "O menu de engrenagem <img class=\"botao-app\" src=\"assets/images/botao_engrenagem.png\"  /> contém as configurações básicas de funcionamento do App",
        "lightbox": [
            {
                "image": "assets/images/login_menu.png",
                "title": "Tela de login com menu aberto"
            }
        ]
    },
    {
        "id": "1.1",
        "title": "Apontamentos de Servidor",
        "date": "2022-05-04",
        "content": "O aplicativo precisa estar configurado para enviar as coletas para a fábrica quando estiver dentro da rede da fábrica. Esta configuração está disponivel no menu da engrenagem, na tela de login. Seu icone é representado por uma nuvem.<br /><img class='botao-app' src='assets/images/BOTAO_NUVEM.png' />",
        "warning": "Esta configuraçao necessita da senha administrativa para ser alterada. Se voce nao e um administrador do aplicativo, contate um representante H&S.",
        "lightbox": [
            {
                "image": "assets/images/popup_adm.png",
                "title": "Tela de login com menu aberto"
            },
            {
                "image": "assets/images/popup_senha.png",
                "title": "Tela de login com menu aberto"
            },
            {
                "image": "assets/images/popup_servidor.png",
                "title": "Tela de login com menu aberto"
            }
        ]
    },
    {
        "id": "1.2",
        "title": "Branding/logo",
        "date": "2022-05-04",
        "content": "Apesar de opcional, esta configuração é interessante para o cliente pois aplica a marca dele no aplicativo. Esta configuração está disponível no menu da engrenagem, na tela de login.        Seu ícone é representado por uma imagem.<br /><img class='botao-app' src='assets/images/BOTAO_IMAGEM.png'   />",
        "warning": "Esta configuraçao necessita da senha administrativa para ser alterada. Se voce nao e um administrador do aplicativo, contate um representante H&S.",
        "aftercontent": "Ao inserir a senha, você poderá escolher uma imagem PNG do logo do cliente. Esta imagem <b>substituirá</b> a imagem padrão do aplicativo",
        "lightbox": [
            {
                "image": "assets/images/popup_senha.png",
                "title": "Popup de confirmação de senha"
            }
        ]
    },
    {
        "id": "1.3",
        "title": "Limpeza de Dados",
        "date": "2022-05-04",
        "content": "Caso seja necessário, o usuário pode limpar os dados offline do aplicativo. Entende-se por dados offline tudo aquilo que foi copiado do servidor para o dispositivo. Esta configuração está disponível no menu da engrenagem, na tela de login. Seu ícone é representado por uma lata com um X.<br /><img class='botao-app' src='assets/images/BOTAO_APAGAR.png'  />",
        "warning": "Ao executar este procedimento NÃO SERÁ POSSÍVEL realizar o login fora da fábrica. Será necessário recuperar os dados de login, veículos, linhas e tanques na fábrica.",
        "aftercontent": "Para evitar acidentes com os dados, uma confirmação por texto é necessária.",
        "lightbox": [
            {
                "image": "assets/images/popup_senha.png",
                "title": "Popup de confirmação de senha"
            }
        ]
    },
    {
        "id": "1.3.1",
        "title": "O Que é Removido",
        "content": " - Último Veículo usado\r\n - Lísta de Veículos\r\n - Linhas Recentes\r\n - Lista de Linhas\r\n - Lista de Tanques\r\n - Informações de Login e Senha"
    },
    {
        "id": "1.3.2",
        "title": "O Que não é Removido",
        "content": " - Informações de Coletas Realizadas\r\n - Logo Customizado do Aplicativo\r\n - Configuração de Apontamento do Servidor"
    },
    {
        "id": "2",
        "icon": "fas fa-user",
        "title": "Login",
        "date": "2022-05-04",
        "content": "Para realizar coletas é necessário fazer o login toda vez que o app for aberto. o ultimo usuário sempre virá preenchido automaticamente, necessitando somente da senha para entrar. Se estiver fora da fábrica, não é possivel trocar o usuario logado.",
        "aftercontent": "Os logins subsequentes podem ser realizados desconectado da rede ou da internet. Caso esteja conectado á fabrica, os login subsequentes também atualizarão os dados (inclusive sua senha, caso tenha solicitado alteração ao administrador).",
        "lightbox": [
            {
                "image": "assets/images/login.png",
                "title": "Tela de Login"
            }
        ]
    },
    {
        "id": "2.1",
        "title": "Credenciais",
        "date": "2022-05-04",
        "content": "Para acessar o App, é necessário liberação por parte do administrador. Após liberação, voce pode acessar o app com seu CPF, CNPJ ou Email cadastrados no sistema SCL.",
        "warning": "O primeiro login deve  ser feito dentro da fábrica, com o dispositivo conectado na mesma rede do servidor. Este primeiro login é importante pós além de  validar as credenciais do motorista/carreteiro, também vai  atualizar os dados do dispositivo  (Veículos, Linhas e Tanques)."
    },
    {
        "id": "2.2",
        "title": "Coletas Abertas",
        "date": "2022-05-04",
        "content": "O motorista pode retomar uma coleta aberta. Caso opte por começar do zero, os dados de coleta atuais são limpos e uma nova coleta será iniciada.",
        "lightbox": [
            {
                "image": "assets/images/popup_coleta_aberta.png",
                "title": "Popup de coleta aberta"
            }
        ]
    },
    {
        "id":"2.3"
    }
]